# 5 Реализуйте алгоритм перемешивания списка.

import random
my_list = input('Введите значения через проблел: ').split(' ')
print (my_list)
random.shuffle(my_list)
print (my_list)